In [0]:
# Persiapan membuat data
import pandas as pd
import random

pelajaran = ['Matematika', 'Fisika', 'Biologi', 'Kimia', 'Geologi', 'Ekonomi']
kelas = ['12A', '12B', '12C', '12D']

hasil_nilai = {
    'siswa_id' : range(1, 21),
    'pelajaran' : [random.choice(pelajaran) for i in range(20)],
    'nilai' : [random.choice(range(0, 100)) for i in range(20)],
    'jenis-kelamin' : [random.choice(['laki-laki', 'perempuan']) for i in range(20)],
    'kelas' : [random.choice(kelas) for i in range(20)]
}

df = pd.DataFrame(hasil_nilai)
df.head()

   siswa_id   pelajaran  nilai jenis-kelamin kelas
0         1      Fisika      9     laki-laki   12A
1         2     Ekonomi     54     laki-laki   12C
2         3      Fisika     91     perempuan   12B
3         4     Biologi     49     perempuan   12B
4         5  Matematika     29     laki-laki   12B

<h2>Soal 1: Indexing</h2>

1. Lakukan indexing terhadap dataframe untuk mengakses column nilai dan kelas saja
2. Lakukan indexing terhadap dataframe untuk mengakses row 5 sampai 10 beserta column pelajaran dan nilai

In [6]:
# code here
df[['nilai', 'kelas']]

    nilai kelas
0      17   12D
1      87   12D
2      28   12C
3      82   12D
4      82   12D
5      86   12A
6      87   12A
7      91   12B
8      48   12A
9      16   12D
10     43   12B
11      5   12D
12     35   12D
13     19   12C
14     52   12A
15     56   12D
16     12   12C
17     70   12D
18      8   12B
19     20   12A

In [7]:
df.loc[4:9,['pelajaran', 'nilai']]

    pelajaran  nilai
4     Biologi     82
5  Matematika     86
6     Biologi     87
7     Geologi     91
8      Fisika     48
9       Kimia     16

<h2>Soal 2: Filter DataFrame Dengan Boolean</h2>

1. Tampilkan semua data siswa pada mata pelajaran Ekonomi dan Fisika
2. Tampilkan semua data siswa yang mempunyai nilai lebih dari 50 di mata pelajaran Kimia 
3. Tampilkan semua data yang mempunyai nilai lebih dari 70, berjnis kelamin perempuan dan di kelas 12C

In [8]:
# code here
ekonomi = df.pelajaran == 'Ekonomi' 
fisika = df.pelajaran == 'Fisika' 
df[ekonomi | fisika]

    siswa_id pelajaran  nilai jenis-kelamin kelas
0          1   Ekonomi     17     laki-laki   12D
3          4    Fisika     82     perempuan   12D
8          9    Fisika     48     perempuan   12A
14        15    Fisika     52     laki-laki   12A
15        16    Fisika     56     perempuan   12D
17        18   Ekonomi     70     perempuan   12D
18        19   Ekonomi      8     laki-laki   12B
19        20    Fisika     20     laki-laki   12A

In [36]:
lebih_50 = df.nilai > 50
kimia = df.pelajaran == 'Kimia'
df[(lebih_50) & (kimia)]

Empty DataFrame
Columns: [siswa_id, pelajaran, nilai, jenis-kelamin, kelas]
Index: []

In [39]:
lebih_70 = df.nilai > 70
gender = df['jenis-kelamin'].values == 'perempuan'
kelas = df.kelas == '12C'
df[(lebih_70) & (gender) & (kelas)]

Empty DataFrame
Columns: [siswa_id, pelajaran, nilai, jenis-kelamin, kelas]
Index: []

<h2>Soal 3: Data Transformation</h2>

lakukan data transformasi terhadap column 'nilai' dengan fungsi transformasi, berikut rumus dari normalisasi

![alt text](https://drive.google.com/uc?id=1wed-EbRSTA0JP1ceDp6lcKBqH2yJ4aa3)

In [6]:
# Persiapan membuat data
import pandas as pd
import random

pelajaran = ['Matematika', 'Fisika', 'Biologi', 'Kimia', 'Geologi', 'Ekonomi']
kelas = ['12A', '12B', '12C', '12D']

hasil_nilai = {
    'siswa_id' : range(1, 21),
    'pelajaran' : [random.choice(pelajaran) for i in range(20)],
    'nilai' : [random.choice(range(0, 100)) for i in range(20)],
    'jenis-kelamin' : [random.choice(['laki-laki', 'perempuan']) for i in range(20)],
    'kelas' : [random.choice(kelas) for i in range(20)]
}

df = pd.DataFrame(hasil_nilai)
df.head()

   siswa_id   pelajaran  nilai jenis-kelamin kelas
0         1       Kimia     91     perempuan   12C
1         2       Kimia     18     perempuan   12A
2         3       Kimia     74     perempuan   12B
3         4      Fisika     26     laki-laki   12A
4         5  Matematika     86     perempuan   12B

In [7]:
# code here
def normalized(x):
    return (x - x.min())/(x.max()-x.min())

In [8]:
print(df.nilai)

0     91
1     18
2     74
3     26
4     86
5     23
6     96
7     81
8     95
9     24
10    17
11    28
12    67
13    13
14    79
15    22
16    81
17    97
18    42
19    67
Name: nilai, dtype: int64

In [9]:
df.nilai.min()

13

In [10]:
df.nilai.max()

97

In [12]:
print(df[['nilai']].apply(normalized))

       nilai
0   0.928571
1   0.059524
2   0.726190
3   0.154762
4   0.869048
5   0.119048
6   0.988095
7   0.809524
8   0.976190
9   0.130952
10  0.047619
11  0.178571
12  0.642857
13  0.000000
14  0.785714
15  0.107143
16  0.809524
17  1.000000
18  0.345238
19  0.642857